{
  "constructor.uid": "Unique identifier of the object",
  "constructor.iconClass": "CSS class of icon. Icons from library PrimeIcons https://v3.primevue.org/icons/ can be displayed only.",
  "constructor.title": "The name of the item that will be displayed in the interface. Maximum length is 100 characters.",
  "constructor.memo": "Free-form text information. Maximum length 300 characters.",
  "metaObjectKind.recordSettings.createRecords": "A flag in the object that generates records, indicating that records need to be created.",
  "metaObjectKind.recordSettings.destination": "The type of metadata object that will store the created records.",
  "metaObjectKind.recordSettings.destinationPeriod": "A column of type DateTime that stores the record creation period.",
  "metaObjectKind.recordSettings.destinationKind": "A column of type Unique Identifier that stores a reference to the type of metadata object that generated the record.",
  "metaObjectKind.recordSettings.destinationMetaObject": "A column of type Unique Identifier that stores a reference to the metadata object that generated the records.",
  "metaObjectKind.recordSettings.destinationObject": "A column that stores a reference to the object that generated the records. The type depends on the primary key type of the metadata object.",
  "metaObjectKind.recordSettings.destinationRow": "A column of type Number that stores the row number of the details table that generated the record.",
  "metaObjectKind.name": "A string identifier for the metadata kind. It must contain only lowercase Latin letters, digits, and underscores. The maximum length is 40 characters. It is used when creating database tables and in references to forms of metadata objects of this kind.",
  "metaObjectKind.prefix": "The prefix of the database table for objects of this metadata kind. It can contain only lowercase Latin letters and digits. The maximum length is 4 characters.",
  "metaObjectKind.storeData": "If enabled, tables will be created in the database to store data associated with objects of the corresponding metadata kind.",
  "metaObjectKind.isReference": "If enabled, metadata objects of this kind can be used as references in the fields of other objects. This is applicable only to objects with the \"Stores data\" setting enabled.",
  "metaObjectKind.allowAttachedFiles": "If enabled, objects of this kind can have attachments. This is applicable only to objects with the \"Stores data\" setting enabled.",
  "metaObjectKind.useDetailsTables": "If enabled, objects of this kind can have details tables. This is applicable only to objects with the \"Stores data\" setting enabled.",
  "metaObjectKind.canCreateRecords": "If enabled, objects of this kind can create records. Additional configuration is required in the \"Record settings\" section.  This is applicable only to objects with the \"Stores data\" setting enabled.",
  "metaObjectKind.orderByExpression": "An expression for sorting items in a list. It can be overridden in the Metadata Object settings. The expression should include the names of sorting fields along with their sorting direction, separated by commas. If a direction is not specified, it is assumed to be \"asc\". Examples: \"title\", \"number desc, date desc\". This is applicable only to objects with the \"Stores Data\" setting enabled.",
  "metaObjectKind.displayExpression": "An expression that defines the display format of an object of this kind. It can be overridden in the Metadata Object settings. The expression can include either a field name or a display template, where fields are specified within double curly braces {{field_name}}. Examples: \"title\", \"Operation #{{number}} from {{date}}\". This is applicable only to objects with the \"Stores Data\" setting enabled.",
  "metaObject.name": "A string identifier for the metadata object. It must contain only lowercase Latin letters, digits, and underscores. The maximum length is 30 characters. It is used when creating database tables and in references to forms of this metadata object.",
  "metaObject.orderByExpression": "An expression for sorting items in a list. If not specified, the default expression defined in the metadata kind is used. If specified, this expression overrides the default for the metadata object. The expression should include the names of sorting fields along with their sorting direction, separated by commas. If a direction is not specified, it is assumed to be \"asc\". Examples: \"title\", \"number desc, date desc\".",
  "metaObject.displayExpression": "An expression that defines the display format of an object of this kind. If not specified, the default expression defined in the metadata kind is used. If specified, this expression overrides the default for the metadata object. The expression can include either a field name or a display template, where fields are specified within double curly braces {{field_name}}. Examples: \"title\", \"Operation #{{number}} from {{date}}\".",
  "metaObject.editMethod": "Defines the method for editing the object: on a separate page or in a modal window.",
  "metaObject.isActive": "If enabled, the object is added to the menu with automatic filling."
}
